tutorials/cases/gasifier/constant/solidThermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.1;
    format      ascii;
    class       dictionary;
    object      solidThermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType solidMixtureThermo<constHeterogeneous>;

solidComponents
(
  ash wood
);

woodCoeffs
{
    transport
    {
        K           0.15;
    }
    thermodynamics
    {
        Cp          2810;
        Hf          -2.12e4;
    }
    density
    {
        rho           663;
    }
};

ashCoeffs
{
    transport
    {
        K           0.15;
    }
    thermodynamics
    {
        Cp          2400;
        Hf          -12.38e6;
    }
    density
    {
        rho           650;
    }
};


// ************************************************************************* //
