tutorials/cases/gasifier/Allrun.sh
#!/bin/sh

cp -r 0.orig 0
blockMesh
setFields
decomposePar
mpirun -np 4 porousGasificationFoam -parallel > log&
